src/main/resources/xmls/salesforcequery/CreateEventRequest.xml

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
   <Header>
      <SessionHeader xmlns="urn:partner.soap.sforce.com">
         <sessionId></sessionId>
      </SessionHeader>
   </Header>
   <Body>
      <create xmlns="urn:partner.soap.sforce.com">
          <sObjects>
            <type xmlns="urn:sobject.partner.soap.sforce.com">Event</type>
            <WhatId xmlns=""></WhatId>
            <WhoId xmlns=""></WhoId>
            <Subject xmlns=""></Subject>
            <Type xmlns=""></Type>
            <StartDateTime xmlns=""></StartDateTime>
            <EndDateTime xmlns=""></EndDateTime>        
            <OwnerId xmlns=""></OwnerId>
          </sObjects>
      </create>
   </Body>
</Envelope>